pmo-dataset/mermaid/09.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1(("start")) --> Task_2["Identify idea for\nnew product or\nimprovement"]
	ParallelGateway_1{"+"} --> Task_12["Conduct feasibility\nstudies"]
	Task_11["Test safety"] --> ParallelGateway_2{"+"}
	Task_5["Refine prototype"] --> ExclusiveGateway_4{"X"}
	Task_7["Approve prototype\nfor further\ndevelopment"] --> ExclusiveGateway_2{"X"}
	Task_2 --> ParallelGateway_1
	ParallelGateway_1 --> Task_9["Conduct initial\nresearch"]
	Task_9 --> ParallelGateway_4{"+"}
	ExclusiveGateway_4 --> ParallelGateway_3{"+"}
	ExclusiveGateway_3{"X"} --> Task_1["Discard prototype"]
	ParallelGateway_3 --> Task_6["Test functionality"]
	ExclusiveGateway_3 --> Task_7
	Task_12 --> ParallelGateway_4
	ParallelGateway_3 --> Task_11
	ExclusiveGateway_1{"X"} --> Task_5
	ExclusiveGateway_1 --> ExclusiveGateway_3
	ParallelGateway_3 --> Task_4["Test market\npotential"]
	Task_8["Select promising\ndesign"] --> Task_13["Build prototype"]
	Task_13 --> ExclusiveGateway_4
	ExclusiveGateway_2 --> EndNoneEvent_1(("end")):::endEvent
	ParallelGateway_4 --> Task_10["Draft design\nconcepts"]
	Task_3["Collect feedback\nfrom testing phase"] --> ExclusiveGateway_1
	ParallelGateway_2 --> Task_3
	Task_10 --> Task_8
	Task_6 --> ParallelGateway_2
	Task_4 --> ParallelGateway_2
	Task_1 --> ExclusiveGateway_2
