pmo-dataset/variations/graphviz_basic/09.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "start" -> "Identify idea for new product or improvement";
  "ParallelGateway_1" -> "Conduct feasibility studies";
  "Test safety" -> "ParallelGateway_2";
  "Refine prototype" -> "ExclusiveGateway_4";
  "Approve prototype for further development" -> "ExclusiveGateway_2";
  "Identify idea for new product or improvement" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Conduct initial research";
  "Conduct initial research" -> "ParallelGateway_4";
  "ExclusiveGateway_4" -> "ParallelGateway_3";
  "ExclusiveGateway_3" -> "Discard prototype";
  "ParallelGateway_3" -> "Test functionality";
  "ExclusiveGateway_3" -> "Approve prototype for further development";
  "Conduct feasibility studies" -> "ParallelGateway_4";
  "ParallelGateway_3" -> "Test safety";
  "ExclusiveGateway_1" -> "Refine prototype";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "ParallelGateway_3" -> "Test market potential";
  "Select promising design" -> "Build prototype";
  "Build prototype" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "end";
  "ParallelGateway_4" -> "Draft design concepts";
  "Collect feedback from testing phase" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "Collect feedback from testing phase";
  "Draft design concepts" -> "Select promising design";
  "Test functionality" -> "ParallelGateway_2";
  "Test market potential" -> "ParallelGateway_2";
  "Discard prototype" -> "ExclusiveGateway_2";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
}
